{"_id": "kicker-360", "name": "Kicker 360", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the kicker with a comfortable, stacked stance and enough speed to clear the landing. As you leave the kicker, pull the handle to your lead hip and start rotating your upper body in the direction of the spin. Keep line tension throughout the rotation and spot your landing over the nose. Absorb the landing with bent knees and ride away on edge.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["legs", "core", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "surface-180", "name": "Surface 180", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Start in a neutral riding position with the handle close to your front hip. Gently unweight the board and rotate your hips and shoulders together to bring the board 180 degrees around. Keep the handle low to maintain line tension and stay balanced over the board. Settle into the new stance and continue riding switch.", "level": "beginner", "mechanic": "spin", "primaryMuscles": ["core", "legs"], "secondaryMuscles": ["ankles", "forearms"]}
{"_id": "ollie", "name": "Ollie", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Ride on a flat line with the handle near your front hip. Push the board down to create line tension, then quickly lift your front foot while jumping off your back foot to pop the board off the water. Keep the handle close to stay balanced in the air. Land with your knees soft and ride away centered.", "level": "beginner", "mechanic": "misc", "primaryMuscles": ["legs", "core"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "heelside-wake-to-wake", "name": "Heelside Wake to Wake", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Take a progressive heelside edge at the wake, building speed slowly and leaning away from the boat. Stand tall at the top of the wake to translate edge pressure into upward pop. Keep the handle low and in close to avoid being pulled over your toes. Spot the landing on the downside of the second wake and absorb with your knees.", "level": "beginner", "mechanic": "airtrick", "primaryMuscles": ["legs", "core", "glutes"], "secondaryMuscles": ["shoulders", "arms", "back"]}
{"_id": "toeside-wake-to-wake", "name": "Toeside Wake to Wake", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Approach the wake on your toeside edge with your chest up and shoulders open to the boat. Keep a steady edge through the wake and extend upward at the top to get lift. Hold the handle close to your lead hip to maintain control in the air. Land on the downside with your weight centered and continue edging away.", "level": "beginner", "mechanic": "airtrick", "primaryMuscles": ["legs", "core", "hip-flexors"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "heelside-180", "name": "Heelside 180", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Perform your normal heelside jump, keeping the handle close as you rise. At the peak of your jump, rotate your shoulders 180 degrees while pulling the handle slightly across your body. Keep your eyes looking toward the direction of travel to avoid over-rotation. Land in switch with your knees bent and handle at the front hip.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["legs", "core", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "toeside-180", "name": "Toeside 180", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Start with a small toeside wake jump and keep the handle in close. As you reach the top of your jump, turn your head and hips to rotate 180 degrees while keeping two hands on the handle as long as possible. Stay over your toes to avoid slipping out. Land in switch and continue edging away from the boat.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "ankles"]}
{"_id": "half-cab", "name": "Half Cab", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Begin riding switch and approach the feature or flat water with the handle close to your lead hip. Pop off the water and rotate 180 degrees back to regular by turning your shoulders in the direction of rotation. Keep your eyes on the landing and maintain line tension so the cable keeps you stable. Land flat or slightly on edge and ride away regular.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "legs"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "switch-heelside-wake-to-wake", "name": "Switch Heelside Wake to Wake", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Ride in switch with a relaxed stance and take a progressive heelside edge toward the wake. Keep your upper body tall and avoid looking down as you stand up through the wake. Maintain the handle at your front hip to stay aligned in the air. Land switch on the downside with soft knees and continue edging out.", "level": "intermediate", "mechanic": "airtrick", "primaryMuscles": ["legs", "core", "glutes"], "secondaryMuscles": ["shoulders", "arms", "back"]}
{"_id": "tail-grab", "name": "Tail Grab", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Pop cleanly off the water or kicker and bring your knees up to your chest. Reach your back hand toward the tail of the board while keeping the handle in the front hand close to your body. Hold the grab briefly while keeping your eyes on the landing area. Let go, extend your legs, and absorb the landing.", "level": "intermediate", "mechanic": "grab", "primaryMuscles": ["core", "hip-flexors", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "indy-grab", "name": "Indy Grab", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Take off with a solid pop and bring the board up beneath you. Reach your rear hand between your feet to grab the toe edge while keeping the handle in the lead hand tight to your hip. Keep your knees slightly apart so you can hold the grab longer. Release and level the board before touching down.", "level": "intermediate", "mechanic": "grab", "primaryMuscles": ["core", "hip-flexors", "shoulders"], "secondaryMuscles": ["arms", "back", "forearms"]}
{"_id": "method-grab", "name": "Method Grab", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Pop high off the wake and immediately tuck your knees while kicking the board slightly out behind you. Reach your back hand to the heel edge between your bindings and pull the board up and across your body to style it out. Keep the handle low with your front hand so you don’t get pulled forward. Release, square the board, and land with your weight centered.", "level": "advanced", "mechanic": "grab", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["back", "arms"]}
{"_id": "frontside-360", "name": "Frontside 360", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Start with a strong heelside jump and keep two hands on the handle as long as possible. Initiate the spin by turning your head and shoulders toward the boat while pulling the handle across your body. Pass the handle on the way down to finish the rotation cleanly. Spot your landing and ride away switch with knees bent.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "backside-360", "name": "Backside 360", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Edge in heelside and pop straight up to get enough air. Look over your back shoulder to start the backside rotation and pull the handle tight to your back hip to stay on axis. Make the handle pass early so you have time to spot the landing. Land with the board pointed downcourse and ride away balanced.", "level": "advanced", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "frontside-540", "name": "Frontside 540", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Take a progressive heelside cut and pop high to give yourself time. Start the frontside rotation with your shoulders and pull the handle tight across your body. Make a clean handle pass behind your back and keep rotating through the final 180 degrees. Spot the landing, keep the handle low, and ride away switch.", "level": "advanced", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "backside-540", "name": "Backside 540", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Pop straight up off the wake with two hands on the handle. Look over your back shoulder to initiate the backside spin and pull the handle to your lower back for the first pass. Stay compact in the air so you can finish the second handle pass smoothly. Land with your knees soft and the handle at your lead hip.", "level": "advanced", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "forearms"]}
{"_id": "tantrum", "name": "Tantrum", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Cut in on a strong heelside edge and square up to the wake just before takeoff. As you ride up the wake, throw your shoulders back like a backflip and let the wake kick your hips up. Keep the handle at your front hip to stay on axis and watch for the water. Spot the landing and absorb with your knees.", "level": "advanced", "mechanic": "flip", "primaryMuscles": ["legs", "core", "hip-flexors"], "secondaryMuscles": ["shoulders", "arms", "back"]}
{"_id": "backroll", "name": "Backroll", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Edge in with good line tension and let the wake stand you up. Roll your hips up and over your shoulders by keeping the handle close and looking over your lead shoulder. Stay tight so the line doesn’t pull you off-axis. Spot the landing, bring the board back under you, and ride away.", "level": "advanced", "mechanic": "invert", "primaryMuscles": ["legs", "core", "glutes"], "secondaryMuscles": ["shoulders", "arms", "back"]}
{"_id": "scarecrow", "name": "Scarecrow", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Take a good toeside cut and stand tall at the top of the wake. Throw your head and shoulders forward and slightly toward the boat to start the front flip while initiating the 180-degree rotation. Keep the handle in close so the rope doesn’t pull you off axis. Land riding switch and continue edging away.", "level": "advanced", "mechanic": "flip", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "raley", "name": "Raley", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Edge hard away from the cable or boat to build strong line tension. As you leave the water, let your hips swing out behind you into the superman position while keeping both hands on the handle. Hold the extended position briefly, then snap your hips back under you by pulling the handle down to your front hip. Land with your knees bent and continue edging.", "level": "advanced", "mechanic": "airtrick", "primaryMuscles": ["core", "glutes", "hamstrings", "shoulders"], "secondaryMuscles": ["arms", "back", "forearms"]}
{"_id": "s-bend", "name": "S-Bend", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Start with a powerful progressive edge and explode upward to create line tension. As you extend into the raley position, initiate a full-body spin by turning your head and shoulders in the direction of rotation. Keep the handle tight and your body long so you stay on axis. Whip your hips back under you to finish and land on a solid edge.", "level": "expert", "mechanic": "airtrick", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "tantrum-to-blind", "name": "Tantrum to Blind", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Perform a standard tantrum by squaring up at the wake and throwing your shoulders back. As you come around from the flip, keep the handle close and rotate the final 180 degrees to blind by pulling the handle behind your back. Stay patient and land with the handle locked to your lower back. Ride away on your toes to avoid catching an edge.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "backroll-to-revert", "name": "Backroll to Revert", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Set up like a normal backroll with a strong edge and tall stance through the wake. As you come around the roll, pull the handle across your body to finish the trick in switch. Keep your head up so you don’t over-rotate. Land switch with soft knees and maintain line tension.", "level": "advanced", "mechanic": "combo", "primaryMuscles": ["legs", "core", "glutes"], "secondaryMuscles": ["shoulders", "arms", "back"]}
{"_id": "kgb", "name": "KGB", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Edge in hard for a backroll and keep the handle tight to your front hip. As you complete the roll, initiate a backside 360 by looking over your rear shoulder and pulling the handle behind your back. Make the handle pass clean to stay on axis. Spot the landing and ride away switch.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "forearms"]}
{"_id": "crow-mobe", "name": "Crow Mobe", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Start with a strong toeside cut and throw a scarecrow-style front flip with a 180. As you come through the flip, pull the handle hard and continue rotating into the backside 360. Keep your body compact so the rope doesn’t pull you off axis. Land switch and ride away on edge.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "pete-rose", "name": "Pete Rose", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Approach toeside with moderate speed and stand tall at the wake. Throw a front flip while pulling the handle across your body to initiate a 540 spin. Keep your eyes tracking the landing to avoid over-rotation. Finish the spin with the handle low and land riding switch.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "slim-chance", "name": "Slim Chance", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Set up for a front flip and throw it with good height. As you come around, continue the rotation with a backside 360 by pulling the handle behind your back. Stay tight and focused on the water so you can spot the landing. Land with your knees bent and ride away clean.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "nose-press-to-180-out", "name": "Nose Press to 180 Out", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the rail with a flat board and hop on to land with your weight forward over the nose. Keep the handle low to stay locked into the press. As you come off the end, pop slightly and rotate 180 degrees while pulling the handle to your lead hip. Land flat and continue in the new direction.", "level": "intermediate", "mechanic": "rail", "primaryMuscles": ["legs", "core", "ankles"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "transfer-270-to-boardslide", "name": "Transfer 270 to Boardslide", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the first feature with enough speed to clear the gap. Pop off and rotate 270 degrees toward the rail while keeping the handle close so you stay over the board. Land in boardslide across the second feature with your weight centered. Hold the slide to the end and pop off clean.", "level": "advanced", "mechanic": "rail", "primaryMuscles": ["legs", "core", "glutes"], "secondaryMuscles": ["shoulders", "arms", "ankles"]}
{"_id": "gap-to-frontboard", "name": "Gap to Frontboard", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Ride in with a flat base and spot the second obstacle early. Pop over the gap and turn your shoulders to land in frontboard across the feature. Keep the handle low at your front hip to stay locked in. Exit straight or with a small 90 out depending on the rail shape.", "level": "intermediate", "mechanic": "rail", "primaryMuscles": ["legs", "core"], "secondaryMuscles": ["shoulders", "arms", "ankles"]}
{"_id": "air-trick-front-flip", "name": "Air Trick Front Flip", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Edge away from the cable to build tension and pop upward aggressively. Throw your head and shoulders forward to initiate the front flip while keeping both hands on the handle. Stay compact so the cable doesn’t pull you off axis. Spot the landing and absorb with your knees.", "level": "advanced", "mechanic": "airtrick", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "krypt", "name": "Krypt", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Begin like a raley, edging hard and letting your body extend behind you. As you reach full extension, pull the handle to your rear hip and rotate 180 degrees to land switch. Keep the line tight so you don’t get pulled off balance. Land on your toes and edge away.", "level": "advanced", "mechanic": "airtrick", "primaryMuscles": ["core", "glutes", "hamstrings"], "secondaryMuscles": ["arms", "back", "shoulders"]}
{"_id": "blind-judge", "name": "Blind Judge", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Throw a strong raley off the line, keeping your body long and the handle close. At the peak of the trick, rotate to blind by pulling the handle behind your back and turning your hips. Stay patient and spot the water over your trailing shoulder. Land on your toes in blind and pass the handle if needed.", "level": "expert", "mechanic": "airtrick", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "mute-half-cab-roll", "name": "Mute Half Cab Roll", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Start riding switch and edge in strong. Pop and initiate a roll while grabbing mute with your front hand to stay compact. Finish the rotation back to regular and keep the handle at your front hip. Land with soft knees and continue riding away regular.", "level": "advanced", "mechanic": "invert", "primaryMuscles": ["legs", "core", "shoulders"], "secondaryMuscles": ["arms", "back", "hip-flexors"]}
{"_id": "switch-backroll", "name": "Switch Backroll", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Ride in switch with a controlled edge and stand tall at the wake. Throw the roll just like your regular backroll, keeping the handle tight and looking over your lead shoulder. Stay compact so the boat doesn’t pull you off axis. Spot the landing and ride away in your natural stance.", "level": "advanced", "mechanic": "invert", "primaryMuscles": ["core", "legs", "glutes"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "wrapped-360", "name": "Wrapped 360", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Set up with the handle wrapped behind your back using a wrap handle or rope wrap. Pop off the water and unwind your upper body to start the 360. Keep the handle close as it comes around to your front side. Land with your weight centered and continue riding.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "shoulders", "legs"], "secondaryMuscles": ["arms", "back"]}
{"_id": "front-mobe", "name": "Front Mobe", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Take a strong toeside cut and throw a front flip. As you come around, pull the handle hard and continue rotating into a backside 360. Keep your body tight and the handle low to stay on axis. Spot the landing and ride away switch.", "level": "expert", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "tootsie-roll", "name": "Tootsie Roll", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Initiate a scarecrow-style front flip with a toeside cut. As you come through the flip, spin the final 180 degrees to land regular. Keep the handle in tight so the rope doesn’t pull you open. Land with knees soft and continue edging away.", "level": "advanced", "mechanic": "combo", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "270-on-270-off", "name": "270 On 270 Off", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the rail with enough speed and pop a 270 onto the feature, keeping the handle close to stay over the board. Lock into the slide with your weight centered. As you reach the end, pop again and unwind with another 270 off in the same direction. Land flat and ride away clean.", "level": "advanced", "mechanic": "rail", "primaryMuscles": ["legs", "core", "ankles"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "rail-ollie-90-to-tail-press", "name": "Rail Ollie 90 to Tail Press", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Ollie onto the rail with a 90-degree turn so the board lands perpendicular to the feature. Shift your weight over the back foot to lock into a tail press. Keep the handle low at your front hip so you stay balanced. Pop off the end and return to your normal riding stance.", "level": "intermediate", "mechanic": "rail", "primaryMuscles": ["legs", "core"], "secondaryMuscles": ["shoulders", "arms", "ankles"]}
{"_id": "tantrum-off-kicker", "name": "Tantrum Off Kicker", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the kicker straight on and stand tall at the lip. Throw your shoulders back into a tantrum-style backflip while keeping both hands on the handle. Stay tight so the cable doesn’t pull you forward mid-flip. Spot your landing early and absorb with your legs.", "level": "advanced", "mechanic": "flip", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "kicker-540", "name": "Kicker 540", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Take an aggressive approach to the kicker with the handle tight to your front hip. As you pop, start a frontside 360 and keep spinning by pulling the handle across your body for the extra 180. Stay compact in the air so you have time to spot the landing. Land in switch and keep the handle low.", "level": "advanced", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "backside-180-off-kicker", "name": "Backside 180 Off Kicker", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Ride at the kicker with a neutral edge and pop straight up. Look over your back shoulder to start the backside 180 and pull the handle to your back hip. Keep the board level and spot the landing. Land switch and continue riding with your knees bent.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "legs"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "air-raley-to-blind", "name": "Air Raley to Blind", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Throw a strong raley and extend fully behind the cable. As you come down, pull the handle to your back hip and rotate to blind. Keep the handle pinned so the rope doesn’t yank you forward. Land on your toes in blind and ride it out.", "level": "expert", "mechanic": "airtrick", "primaryMuscles": ["core", "glutes", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "tailslide-to-fakie", "name": "Tailslide to Fakie", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Approach the rail slightly angled and ollie on, shifting your weight over the tail to slide. Keep the handle low and slightly behind you so the tail stays locked. At the end of the rail, let the board pivot and exit in fakie. Absorb the landing and continue riding switch.", "level": "intermediate", "mechanic": "rail", "primaryMuscles": ["legs", "core", "ankles"], "secondaryMuscles": ["shoulders", "arms"]}
{"_id": "nose-grab-tantrum", "name": "Nose Grab Tantrum", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Perform a tantrum with strong pop off the wake. As you go inverted, reach your free hand to grab the nose of the board and hold it to add style. Keep the handle close with your other hand so you don’t get pulled off axis. Release the grab, spot the landing, and ride away.", "level": "advanced", "mechanic": "flip", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "hip-flexors"]}
{"_id": "wrapped-kicker-360", "name": "Wrapped Kicker 360", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Set up with the handle wrapped behind your back as you approach the kicker. Pop off the kicker and let your upper body unwind to start the 360. Keep your eyes on the landing and allow the rope to come back to your front side naturally. Land centered and continue riding.", "level": "intermediate", "mechanic": "spin", "primaryMuscles": ["core", "shoulders", "legs"], "secondaryMuscles": ["arms", "back"]}
{"_id": "switch-frontside-360", "name": "Switch Frontside 360", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Ride in switch and take a solid heelside cut. Pop high and start the frontside spin by turning your head toward the boat and pulling the handle across your body. Make the handle pass early so you have time to spot the landing. Land regular with soft knees.", "level": "advanced", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back"]}
{"_id": "double-s-bend", "name": "Double S-Bend", "category": "wakeboarding", "equipment": "cable park", "force": "pull", "instructions": "Only attempt after mastering the single S-Bend. Edge in with maximum line tension and throw the first S-Bend with a fast, snappy rotation. As you come around, keep the handle tight and continue the rotational momentum into a second inverted spin. Spot the water, pull your hips back under you, and land on a strong edge.", "level": "expert", "mechanic": "airtrick", "primaryMuscles": ["core", "legs", "shoulders", "glutes"], "secondaryMuscles": ["arms", "back", "neck"]}
{"_id": "heelside-900", "name": "Heelside 900", "category": "wakeboarding", "equipment": "boat", "force": "pull", "instructions": "Take a strong, progressive heelside cut and pop as high as possible to create time for the rotation. Start with a frontside 540 motion, pulling the handle across your body and making the first pass quickly. Stay compact and continue rotating the final 360 while keeping the handle low. Spot the landing late, extend your legs, and ride away switch.", "level": "expert", "mechanic": "spin", "primaryMuscles": ["core", "legs", "shoulders"], "secondaryMuscles": ["arms", "back", "neck"]}
